# Tap
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"

# Core
brew "git" # Should be installed by now
brew "tig"
brew "zsh"
brew "grep"
brew "jq"
brew "curl"
brew "wget"
brew "cask"
brew "go"
brew "coreutils"
brew "findutils"
brew "thefuck" # CLI failed command correction
brew "ncdu" # Interactive diskspace overview
brew "ffmpeg"
brew "gifsicle"
brew "tldr"
brew "svn" # Needed for fonts
brew "cmake"
brew "awscli"
brew "rust"
brew "postman"
brew "mas"

# Cask
cask "fig" # Part of the dotfiles setup
cask "1password"
cask "spectacle"
cask "visual-studio-code"
cask "tableplus"
cask "docker"
cask "google-chrome"
cask "spotify"
cask "slack"
cask "discord"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-roboto-mono-for-powerline"
cask "font-hack"
cask "warp"
cask "viscosity"
cask "brooklyn"
cask "maccy"
