# Core
brew "git" # Should be installed by now
brew "tig"
brew "zsh"
brew "grep"
brew "jq"
brew "curl"
brew "wget"
brew "go"
brew "coreutils"
brew "findutils"
brew "ffmpeg"
brew "gifsicle"
brew "tldr"
brew "cmake"
brew "mas" # App store
brew "neovim"
brew "fnm" # Node version manager

# Cask
cask "docker-desktop"
cask "spotify"
cask "slack"
cask "discord"
cask "claude-code"
cask "codex"
cask "font-hack"
cask "viscosity" # VPN
cask "maccy" # Clipboard manager
cask "ghostty"
cask "cursor"
cask "tableplus"
cask "zen"
cask "gh"
