# Tap
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"

# Core
brew "git" # Should be installed by now
brew "tig"
brew "zsh"
brew "grep"
brew "jq"
brew "curl"
brew "wget"
brew "cask"
brew "go"
brew "coreutils"
brew "findutils"
brew "ncdu" # Interactive diskspace overview
brew "ffmpeg"
brew "gifsicle"
brew "tldr"
brew "svn" # Needed for fonts
brew "cmake"
brew "awscli"
brew "mas"
brew "neovim"

# Cask
cask "tableplus"
cask "docker"
cask "spotify"
cask "slack"
cask "discord"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-roboto-mono-for-powerline"
cask "font-hack-nerd-font"
cask "font-sf-pro"
cask "warp"
cask "viscosity"
cask "maccy"
cask "postman"
cask "cursor"
cask "arc"
cask "obsidian"
